Repository: MADTeacher/flutter_basics
Catalog: 8/8.5/app_localization/lib/l10n/app_*.arb
Languages: ru

# nameHint
source: Enter your name
ru: Введите ваше имя

# hello
source: Hello {userName}!
ru: Привет, {userName}!

source: Send
ru: Отправить

# title
source: Pizza Details
ru: Детали пиццы

# pizzaName
source: Pepperoni Pizza
ru: Пицца Пепперони

# pizzaIngredients
source: Ingredients: Pepperoni, Cheese, Tomato Sauce
ru: Ингредиенты: Пепперони, Сыр, Томатный соус

# orderPizzaButton
source: {count, plural, =0{Order first pizza} other{Order 1 more pizza}}
ru: {count, plural, =0{Заказать первую пиццу} other{Заказать ещё 1 пиццу}}

# orderPizza
source: {count, plural, =0{You haven't ordered any pizzas yet} =1{You ordered 1 pizza} other{You ordered {count} pizzas}}
ru: {count, plural, =0{Вы еще не заказали ни одной пиццы} =1{Вы заказали 1 пиццу} few{Вы заказали {count} пиццы} other{Вы заказали {count} пицц}}

# pizzaSizeLabel
source: Select pizza size
ru: Выберите размер пиццы

# selectedSize
source: Selected pizza size - {size}
ru: Выбранный размер пиццы - {size}

# pizzaSize
source: {size, select, mini{Mini} small{Small} medium{Medium} large{Large} supersize{Supersize} other{Unknown}}
ru: {size, select, mini{Мини} small{Маленький} medium{Средний} large{Большой} supersize{Суперсайз} other{Неизвестный}}
